#+TITLE: Week 11 Workbook
#+AUTHOR: Bryan Muller
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty inlineimages


** Exercise 18.4.2
#+BEGIN_SRC elisp
(church-to-nat (funcall (funcall MUL (nat-to-church 4)) (nat-to-church 8)))
#+END_SRC

#+RESULTS:
: 32

** DONE Exercise 18.8.2
   CLOSED: [2019-04-03 Wed 13:44]

#+BEGIN_SRC python :results output
  # Below, for clarity, we use don't use Church numerals..
  # The Ye -- eager Y combinator

  Ye = lambda f: (lambda x: x(x))(lambda y: f(lambda v: y(y)(v)))
  # Pre-Factorial: performs the product of 
  # a natural number and all natural number less than it
  # We call it pre-factorial because we need to apply
  # Y to it to obtain the real factorial

  prefact = lambda fact: lambda n: (1 if n==0 else n*fact(n-1))

  # Pre-sum: sums all the natural numbers less than the given number

  presum = lambda f: lambda n: (0 if n==0 else n+f(n-1))

  # Pre-Fib: returns the nth number of the series defined by 
  # the following definitions
  #  the first two numbers are 1 and 1
  #  the next number is defined as the sum of the prior two numbers

  prefib = lambda f: lambda n: 0 if n == 0 else (1 if n == 1 else f(n-1) + f(n-2))

  fact = lambda n: Ye(prefact)(n)
  sum = lambda n: Ye(presum)(n)

  print("fact examples")
  print(fact(3))
  print(fact(5))
  print(fact(8))
  print("Sum examples")
  print(sum(3))
  print(sum(5))
  print(sum(8))
#+END_SRC

#+RESULTS:
: fact examples
: 6
: 120
: 40320
: Sum examples
: 6
: 15
: 36

